artillery_testing.yml
config:
  target: "http://localhost:3002"
  phases:
    - duration: 60
      arrivalRate: 1
      name: "Warm up the application"
    - duration: 120
      arrivalRate: 1
      rampTo: 10
      name: "jump to max load"
    - duration: 120
      arrivalRate: 10
      name: "keep at the max load"
    - duration: 60
      arrivalRate: 10
      rampTo: 1
      name: "calm down"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: '80'
    weight: 4
    flow: 
        - loop:
            - get:
                url: "/booking/{{$randomNumber(8000000, 10000000)}}"
          count: 100
  - name: '20'
    weight: 1
    flow: 
        - loop:
            - get:
                url: "/booking/{{$randomNumber(1, 8000000)}}"
          count: 100